app/views/alunos/_form.html.erb

    <div>
    <%= check_box_tag "aluno[projeto_ids][]", projeto.id, aluno.projetos.include?(projeto) %>
---
SELECT "projetos".* FROM "projetos"
SELECT  1 AS one FROM "projetos" INNER JOIN "alunos_projetos" ON "projetos"."id" = "alunos_projetos"."projeto_id" WHERE "alunos_projetos"."aluno_id" = ? AND "projetos"."id" = ? LIMIT ?  [["aluno_id", 1], ["id", 1], ["LIMIT", 1]]