app/controllers/api/v1/alunos_controller.rb

      def index
        alunos = Aluno.order('id DESC')
---
SELECT "alunos".* FROM "alunos" ORDER BY id DESC

      def show
        aluno = Aluno.find(params[:id])
---
SELECT  "alunos".* FROM "alunos" WHERE "alunos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

      def create
        aluno = Aluno.new(aluno_params)

        if aluno.save
---
INSERT INTO "alunos" ("nome", "categoria", "curso", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nome", "Aluno Teste"], ["categoria", "Graduação"], ["curso", "Sistemas de Informação"], ["created_at", "2019-06-05 14:17:23.578318"], ["updated_at", "2019-06-05 14:17:23.578318"]]

      def destroy
        aluno = Aluno.find(params[:id])
        aluno.destroy
---
SELECT  "alunos".* FROM "alunos" WHERE "alunos"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "alunos" WHERE "alunos"."id" = ?  [["id", 4]]

      def update
        aluno = Aluno.find(params[:id])
        if aluno.update_attributes(aluno_params)
---
SELECT  "alunos".* FROM "alunos" WHERE "alunos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "alunos" SET "nome" = ?, "categoria" = ?, "updated_at" = ? WHERE "alunos"."id" = ?  [["nome", "Jonas Junior"], ["categoria", "Pós-doutorado"], ["updated_at", "2019-07-04 23:05:28.533718"], ["id", 3]]