app/controllers/api/v1/aulas_controller.rb

      def index
        aulas = Aula.order('id DESC')
---
SELECT "aulas".* FROM "aulas" ORDER BY id DESC

      def show
        aula = Aula.find(params[:id])
---
SELECT  "aulas".* FROM "aulas" WHERE "aulas"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

      def create
        aula = Aula.new(aula_params)
        attach_main_material(aula) if aula_params[:materialDidatico].present?

        if aula.save
---
INSERT INTO "aulas" ("nomeAula", "categoria", "quantidade", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nomeAula", "Aula Nova"], ["categoria", "Graduação"], ["quantidade", 5], ["created_at", "2019-07-01 12:45:58.427978"], ["updated_at", "2019-07-01 12:45:58.427978"]]

      def destroy
        aula = Aula.find(params[:id])
        aula.destroy
---
SELECT  "aulas".* FROM "aulas" WHERE "aulas"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "aulas" WHERE "aulas"."id" = ?  [["id", 3]]

      def update
        aula = Aula.find(params[:id])
        if aula.update_attributes(aula_params)
---
SELECT  "aulas".* FROM "aulas" WHERE "aulas"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "aulas" SET "categoria" = ?, "updated_at" = ? WHERE "aulas"."id" = ?  [["categoria", "Pós-Graduação"], ["updated_at", "2019-07-04 22:12:37.229661"], ["id", 3]]