app/controllers/api/v1/professors_controller.rb

SELECT "professors".* FROM "professors" ORDER BY id DESC
---
      def index
        professors = Professor.order('id DESC')

SELECT  "professors".* FROM "professors" WHERE "professors"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
      def show
        professor = Professor.find(params[:id])

INSERT INTO "professors" ("nomeProfessor", "sala", "email", "telefone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
      def create
        professor = Professor.new(professor_params)

        if professor.save

SELECT  "professors".* FROM "professors" WHERE "professors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "professors" WHERE "professors"."id" = ?  [["id", 2]]
---
      def destroy
        professor = Professor.find(params[:id])
        professor.destroy

SELECT  "professors".* FROM "professors" WHERE "professors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "professors" SET "formacao" = ?, "password_digest" = ?, "updated_at" = ? WHERE "professors"."id" = ?  [["formacao", "formou na ufla"], ["password_digest", "$2a$12$ZWEIdryxh5ldB67N9zhNM.acIZG1hYBgPd5f4B3FKsYLAVjacz9gy"], ["updated_at", "2019-06-29 14:37:13.178031"], ["id", 1]]
---
      def update
        professor = Professor.find(params[:id])
        if professor.update_attributes(professor_params)