app/controllers/api/v1/projetos_controller.rb

SELECT "projetos".* FROM "projetos" ORDER BY id DESC
---
      def index
        projetos = Projeto.order('id DESC')

SELECT  "projetos".* FROM "projetos" WHERE "projetos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      def show
        projeto = Projeto.find(params[:id])

INSERT INTO "projetos" ("nomeProjeto", "inicio", "termino", "resumo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nomeProjeto", "Projeto Teste"], ["inicio", 2007], ["termino", 2009], ["resumo", "bla bla bla bla"], ["created_at", "2019-07-01 12:38:40.493999"], ["updated_at", "2019-07-01 12:38:40.493999"]]
---
      def create
        projeto = Projeto.new(projeto_params)

        if projeto.save

SELECT  "projetos".* FROM "projetos" WHERE "projetos"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "projetos" WHERE "projetos"."id" = ?  [["id", 5]]
---
      def destroy
        projeto = Projeto.find(params[:id])
        projeto.destroy

SELECT  "projetos".* FROM "projetos" WHERE "projetos"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "projetos" SET "resumo" = ?, "updated_at" = ? WHERE "projetos"."id" = ?  [["resumo", "Este é um resumo sincero para o projeto 1."], ["updated_at", "2019-07-01 20:30:54.053707"], ["id", 1]]
---
      def update
        projeto = Projeto.find(params[:id])
        if projeto.update_attributes(projeto_params)