app/controllers/api/v1/publicacaos_controller.rb

SELECT "publicacaos".* FROM "publicacaos" ORDER BY id DESC
---
      def index
        publicacoes = Publicacao.order('id DESC')

SELECT  "publicacaos".* FROM "publicacaos" WHERE "publicacaos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
      def show
        publicacao = Publicacao.find(params[:id])

INSERT INTO "publicacaos" ("nomePublicacao", "categoria", "arquivoBib", "data", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
      def create
        publicacao = Publicacao.new(publicacao_params)

        if publicacao.save

SELECT  "publicacaos".* FROM "publicacaos" WHERE "publicacaos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "publicacaos" WHERE "publicacaos"."id" = ?  [["id", 1]]
---
      def destroy
        publicacao = Publicacao.find(params[:id])
        publicacao.destroy

SELECT  "publicacaos".* FROM "publicacaos" WHERE "publicacaos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "publicacaos" SET "nomePublicacao" = ?, "updated_at" = ? WHERE "publicacaos"."id" = ?  [["nomePublicacao", "Publicação 34"], ["updated_at", "2019-07-01 12:23:42.714154"], ["id", 3]]
---
      def update
        publicacao = Publicacao.find(params[:id])
        if publicacao.update_attributes(publicacao_params)