app/controllers/alunos_controller.rb

  def index
    @alunos = Aluno.all
---
SELECT "alunos".* FROM "alunos"

  def show
    @aluno = Aluno.find(params[:id])
---
SELECT  "alunos".* FROM "alunos" WHERE "alunos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def new
    @aluno = Aluno.new
    @projetos = Projeto.all
---
SELECT "projetos".* FROM "projetos"

  def edit
    @alunos = Aluno.all
    @projetos = Projeto.all
---
SELECT "projetos".* FROM "projetos"

  def create
    @aluno = Aluno.new(aluno_params)

    respond_to do |format|
      if @aluno.save
---
INSERT INTO "alunos" ("idAluno", "nome", "categoria", "curso", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["idAluno", "112"], ["nome", "adsdasd"], ["categoria", "asdasdas"], ["curso", "dasdasdas"], ["created_at", "2019-04-26 00:42:27.963029"], ["updated_at", "2019-04-26 00:42:27.963029"]]

  def update
    params[:aluno][:projeto_ids] ||= []
    @aluno = Aluno.find(params[:id])
---
SELECT  "alunos".* FROM "alunos" WHERE "alunos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @aluno.destroy
---
DELETE FROM "alunos" WHERE "alunos"."id" = ?  [["id", 2]]

    def set_aluno
      @aluno = Aluno.find(params[:id])
---
SELECT  "alunos".* FROM "alunos" WHERE "alunos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]