app/controllers/aulas_controller.rb

SELECT "aulas".* FROM "aulas"
---
  def index
    @aulas = Aula.all

INSERT INTO "aulas" ("nomeAula", "categoria", "quantidade", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nomeAula", "Aleluia"], ["categoria", "Mandarim"], ["quantidade", 6], ["created_at", "2019-04-24 13:52:48.909419"], ["updated_at", "2019-04-24 13:52:48.909419"]]
---
  def create
    @aula = Aula.new(aula_params)

    respond_to do |format|
      if @aula.save

SELECT  "aulas".* FROM "aulas" WHERE "aulas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_aula
      @aula = Aula.find(params[:id])