app/controllers/professors_controller.rb

  def index
    @professors = Professor.all
---
SELECT "professors".* FROM "professors"