app/controllers/projetos_controller.rb

SELECT "projetos".* FROM "projetos"
---
  def index
    @projetos = Projeto.all

INSERT INTO "projetos" ("nomeProjeto", "inicio", "termino", "resumo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nomeProjeto", "Blablabla"], ["inicio", 6], ["termino", 12], ["resumo", "ssdoshidoasiodhas"], ["created_at", "2019-04-26 00:35:43.757350"], ["updated_at", "2019-04-26 00:35:43.757350"]]
---
  def create
    @projeto = Projeto.new(projeto_params)

    respond_to do |format|
      if @projeto.save

DELETE FROM "projetos" WHERE "projetos"."id" = ?  [["id", 1]]
---
  def destroy
    @projeto.destroy

SELECT  "projetos".* FROM "projetos" WHERE "projetos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_projeto
      @projeto = Projeto.find(params[:id])