app/controllers/signin_controller.rb

SELECT  "professors".* FROM "professors" WHERE "professors"."email" = ? LIMIT ?  [["email", "axsxasxsax"], ["LIMIT", 1]]
---
  def create
    user = Professor.find_by!(email: params[:email])